-- tagテーブルへのデータ挿入
INSERT INTO tag (id, name) VALUES 
('1', 'タグ1'),
('2', 'タグ2'),
('3', 'タグ3'),
('4', 'タグ4'),
('5', 'タグ5'),
('6', 'タグ6'),
('7', 'タグ7'),
('8', 'タグ8'),
('9', 'タグ9'),
('10', 'タグ10'),
('11', 'タグ11'),
('12', 'タグ12'),
('13', 'タグ13'),
('14', 'タグ14'),
('15', 'タグ15');

-- postテーブルへのデータ挿入
INSERT INTO post (id, text, tag1, tag2, tag3) VALUES 
('1', '投稿1のテキスト', '1', NULL, NULL),
('2', '投稿2のテキスト', '4', '9', NULL),
('3', '投稿3のテキスト', NULL, NULL, NULL),
('4', '投稿4のテキスト', '7', '10', '15'),
('5', '投稿5のテキスト', NULL, NULL, '4');